Terraform Format and Style: success
Terraform Initialization: success
Terraform Validation: success
Terraform Plan: success

<details><summary>Show Plan</summary>

```

module.redis.data.cloudfoundry_service.redis: Reading...
module.database.data.cloudfoundry_space.space: Reading...
module.redis.data.cloudfoundry_space.space: Reading...
module.database.data.cloudfoundry_service.rds: Reading...
module.egress-space.data.cloudfoundry_org.org: Reading...
module.sns_sms.data.cloudfoundry_org.org: Reading...
module.sns_sms.data.cloudfoundry_space.space: Reading...
module.ses_email.data.cloudfoundry_service.ses: Reading...
module.csv_upload_bucket.data.cloudfoundry_service.s3: Reading...
module.sns_sms.data.cloudfoundry_service.sns: Reading...
module.redis.data.cloudfoundry_service.redis: Read complete after 0s [id=045871d3-d9a8-4a9b-a844-00a067fab054]
module.ses_email.data.cloudfoundry_space.space: Reading...
module.csv_upload_bucket.data.cloudfoundry_service.s3: Read complete after 0s [id=440ce9d9-b108-4bbe-80b4-08338f3cc25b]
module.csv_upload_bucket.data.cloudfoundry_space.space: Reading...
module.sns_sms.data.cloudfoundry_org.org: Read complete after 0s [id=9e428562-a2d9-41b4-9c23-1ef5237fb44e]
module.ses_email.data.cloudfoundry_org.org: Reading...
module.egress-space.data.cloudfoundry_org.org: Read complete after 0s [id=9e428562-a2d9-41b4-9c23-1ef5237fb44e]
module.ses_email.data.cloudfoundry_service.ses: Read complete after 0s [id=b41dc2f2-7825-4a8e-987a-ce87a161e670]
module.egress-space.cloudfoundry_space.public_egress: Refreshing state... [id=21b58751-362b-433a-a285-8a1455d9634f]
module.egress-space.data.cloudfoundry_user.users["3416d155-a1eb-4953-bc79-76712aaa7910"]: Reading...
module.database.data.cloudfoundry_service.rds: Read complete after 0s [id=dcfb1d43-f22c-42d3-962c-7ae04eda24e7]
module.egress-space.data.cloudfoundry_user.users["steven.reilly@gsa.gov"]: Reading...
module.sns_sms.data.cloudfoundry_service.sns: Read complete after 0s [id=9c59e780-af5a-4a89-ac31-591a3ae1347e]
module.egress-space.data.cloudfoundry_user.users["carlo.costino@gsa.gov"]: Reading...
module.redis.data.cloudfoundry_space.space: Read complete after 0s [id=9745decb-4988-4bab-88a4-e3f07b36241c]
module.sns_sms.data.cloudfoundry_space.space: Read complete after 0s [id=9745decb-4988-4bab-88a4-e3f07b36241c]
module.redis.cloudfoundry_service_instance.redis: Refreshing state... [id=ebcfe297-b76f-4d71-a6a7-bf6c12b2587c]
module.sns_sms.cloudfoundry_service_instance.sns: Refreshing state... [id=d09f8305-42c1-4b74-820e-5479cdcf515a]
module.ses_email.data.cloudfoundry_space.space: Read complete after 0s [id=9745decb-4988-4bab-88a4-e3f07b36241c]
module.ses_email.cloudfoundry_service_instance.ses: Refreshing state... [id=bc6b3f0b-dc2f-4b46-84d1-3940c29693d7]
module.ses_email.data.cloudfoundry_org.org: Read complete after 1s [id=9e428562-a2d9-41b4-9c23-1ef5237fb44e]
module.database.data.cloudfoundry_space.space: Read complete after 1s [id=9745decb-4988-4bab-88a4-e3f07b36241c]
module.database.cloudfoundry_service_instance.rds: Refreshing state... [id=b8caaa4f-b3b8-4dbc-ba16-95d3899be5a0]
module.csv_upload_bucket.data.cloudfoundry_space.space: Read complete after 1s [id=9745decb-4988-4bab-88a4-e3f07b36241c]
module.csv_upload_bucket.cloudfoundry_service_instance.bucket: Refreshing state... [id=b15631b3-00fb-49f6-a4d3-ebaedfca1cd9]
module.egress-space.data.cloudfoundry_user.users["3416d155-a1eb-4953-bc79-76712aaa7910"]: Read complete after 1s [id=bd05a408-f276-4f68-9fa6-efc89442a642]
module.egress-space.data.cloudfoundry_user.users["steven.reilly@gsa.gov"]: Read complete after 1s [id=ffd00a3e-aa1a-42e1-a81a-5f60420658c2]
module.egress-space.data.cloudfoundry_user.users["carlo.costino@gsa.gov"]: Read complete after 1s [id=c7b9f5e0-4d1b-43b1-a659-e8fe4f7083a8]
module.egress-space.cloudfoundry_space_users.deployers: Refreshing state... [id=3fbb7982-1e77-4219-cc78-986468887dd7]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.egress-space.cloudfoundry_space.public_egress will be updated in-place
  ~ resource "cloudfoundry_space" "public_egress" {
      + delete_recursive_allowed = true
        id                       = "21b58751-362b-433a-a285-8a1455d9634f"
        name                     = "notify-staging-egress"
        # (7 unchanged attributes hidden)
    }

  # module.ses_email.cloudfoundry_space.cf_ses_service_space will be created
  + resource "cloudfoundry_space" "cf_ses_service_space" {
      + allow_ssh                = (known after apply)
      + auditors                 = (known after apply)
      + delete_recursive_allowed = true
      + developers               = (known after apply)
      + id                       = (known after apply)
      + managers                 = (known after apply)
      + name                     = "notify-staging"
      + org                      = "9e428562-a2d9-41b4-9c23-1ef5237fb44e"
    }

  # module.sns_sms.cloudfoundry_space.cf_sns_service_space will be created
  + resource "cloudfoundry_space" "cf_sns_service_space" {
      + allow_ssh                = (known after apply)
      + auditors                 = (known after apply)
      + delete_recursive_allowed = true
      + developers               = (known after apply)
      + id                       = (known after apply)
      + managers                 = (known after apply)
      + name                     = "notify-staging"
      + org                      = "9e428562-a2d9-41b4-9c23-1ef5237fb44e"
    }

Plan: 2 to add, 1 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.csv_upload_bucket.cloudfoundry_service_instance.bucket,
  on .terraform/modules/csv_upload_bucket/s3/main.tf line 14, in resource "cloudfoundry_service_instance" "bucket":
  14:   recursive_delete = var.recursive_delete

Since CF API v3, recursive delete is always done on the cloudcontroller side.
This will be removed in future releases

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @ccostino, Action: `pull_request`*